# How to read Tabular Data?

In [1]:
import pandas as pd

In [2]:
orders = pd.read_table('http://bit.ly/chiporders')

C:\Users\Pranab Ranjan Mishra\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.
  """Entry point for launching an IPython kernel.

In [6]:
orders = pd.read_csv('http://bit.ly/chiporders', sep = '\t')

In [4]:
orders.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [5]:
movies = pd.read_csv('http://bit.ly/movieusers', sep = '|')
movies.head()

   1  24  M  technician  85711
0  2  53  F       other  94043
1  3  23  M      writer  32067
2  4  24  M  technician  43537
3  5  33  F       other  15213
4  6  42  M   executive  98101

## Understanding about DataTypes of each column

In [25]:
orders.dtypes

order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

# How to read only specified columns at the time of reading CSV ?

In [11]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head(2)

          City Colors Reported Shape Reported State             Time
0       Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro             NaN          OTHER    NJ  6/30/1930 20:00

In [8]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [12]:
# we have to read only 2 columns at the time of reading CSV

ufo = pd.read_csv('http://bit.ly/uforeports', usecols = ['City', 'Shape Reported'])

In [10]:
ufo.columns

Index(['City', 'Shape Reported'], dtype='object')

In [13]:
ufo.head(2)

          City Shape Reported
0       Ithaca       TRIANGLE
1  Willingboro          OTHER

# How to read specific number of rows at the time of reading?

In [14]:
ufo = pd.read_csv('http://bit.ly/uforeports', nrows = 3)

# nrows will helps to read specified number of rows

In [15]:
ufo

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00
2      Holyoke              NaN           OVAL    CO  2/15/1931 14:00

# How to iterate individual entries from a column ?

In [19]:
ufo = pd.read_csv('http://bit.ly/uforeports', nrows = 10)

In [20]:
ufo.head(2)

          City  Colors Reported Shape Reported State             Time
0       Ithaca              NaN       TRIANGLE    NY   6/1/1930 22:00
1  Willingboro              NaN          OTHER    NJ  6/30/1930 20:00

In [21]:
for c in ufo.City:
    print(c)

Ithaca
Willingboro
Holyoke
Abilene
New York Worlds Fair
Valley City
Crater Lake
Alma
Eklutna
Hubbard

## How to iterate multiple entries?

In [22]:
for index, row in ufo.iterrows():
    print(index,row.City,row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO
3 Abilene KS
4 New York Worlds Fair NY
5 Valley City ND
6 Crater Lake CA
7 Alma MI
8 Eklutna AK
9 Hubbard OR

## How to drop Non numeric column from a dataframe?

In [26]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [27]:
drinks.head(2)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe

In [28]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [30]:
import numpy as np

drinks_num = drinks.select_dtypes(include = [np.number])

In [31]:
drinks_num.head(2)

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9

In [32]:
drinks_num.dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

# How to set Maximum row to display?

#### set_option Method

In [33]:
import pandas as pd

# Set ipython's max row display
pd.set_option('display.max_row', 1000)

# Set iPython's max column width to 50
pd.set_option('display.max_columns', 50)

# How to Make all column name in uppercase/lowercase format?

In [35]:
drinks.head(2)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe

In [36]:
drinks.columns = map(str.upper, drinks.columns)

In [37]:
drinks.head(2)

,COUNTRY,BEER_SERVINGS,SPIRIT_SERVINGS,WINE_SERVINGS,TOTAL_LITRES_OF_PURE_ALCOHOL,CONTINENT
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe

In [38]:
drinks.columns = map(str.lower, drinks.columns)

In [39]:
drinks.head(2)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe